/*원본
data: [
    {
      period: '2017-08-01',
      ratio: 7.26119,
      group: '10'
    },
    {
      period: '2017-08-01',
      ratio: 43.32174,
      group: '20'
    },
    {
      period: '2017-08-01',
      ratio: 53.28287,
      group: '30'
    },
    {
      period: '2017-08-01',
      ratio: 16.7928,
      group: '40'
    },
    {
      period: '2017-09-01',
      ratio: 10.14522,
      group: '10'
    },
    {
      period: '2017-09-01',
      ratio: 74.84148,
      group: '20'
    },
    {
      period: '2017-09-01',
      ratio: 100,
      group: '30'
    },
    {
      period: '2017-09-01',
      ratio: 22.00859,
      group: '40'
    }
  ]
*/

/* 목표하는 배열
data: [
  {
    period: '2017-08-01',
    '10대': 7.26119,
    '20대': 43.32174,
    '30대': 53.28287,
    '40대': 16.7928
  },
  {
    period: '2017-09-01',
    '10대': 10.14522,
    '20대': 74.84148,
    '30대': 100,
    '40대': 22.00859
  },
]

Line 을 위한 배열 

lineData: [
  10대,
  20대,
  30대,
  40대,
]
*/

/* 요구되는 배열
const data = [
  {
    name: 'Page A',
    uv: 4000,
    pv: 2400,
    amt: 2400,
  },
  {
    name: 'Page B',
    uv: 3000,
    pv: 1398,
    amt: 2210,
  },
  {
    name: 'Page C',
    uv: 2000,
    pv: 9800,
    amt: 2290,
  },
  {
    name: 'Page D',
    uv: 2780,
    pv: 3908,
    amt: 2000,
  }
]
*/
